Tekla.Structures.Drawing.Internal.DgUtil
Internal helper for .dg-file related operations.

Tekla.Structures.Drawing.Internal.DgUtil.GetDgFileNameByDrawingGuid(System.Guid)
Gets drawing (.dg) file name using drawing guid.
drawingGuid: Drawing guid
Returns:

Tekla.Structures.Drawing.Internal.DgUtil.GetDgGuidByDrawingGuid(System.Guid)
Gets guid from drawing file name using drawing Guid
drawingGuid: Drawing guid
Returns: